{
  "config": {
    "input_layers": [
      [
        "input_6",
        0,
        0
      ]
    ],
    "layers": [
      {
        "config": {
          "batch_input_shape": [
            null,
            2,
            3,
            3
          ],
          "sparse": false,
          "name": "input_6",
          "dtype": "float32"
        },
        "inbound_nodes": [],
        "name": "input_6",
        "class_name": "InputLayer"
      },
      {
        "config": {
          "dilation_rate": [
            1,
            1
          ],
          "filters": 2,
          "trainable": true,
          "activation": "linear",
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "use_bias": true,
          "activity_regularizer": null,
          "strides": [
            1,
            1
          ],
          "bias_regularizer": null,
          "kernel_constraint": null,
          "name": "conv2d_16",
          "bias_constraint": null,
          "padding": "same",
          "kernel_initializer": {
            "config": {
              "distribution": "uniform",
              "mode": "fan_avg",
              "seed": null,
              "scale": 1.0
            },
            "class_name": "VarianceScaling"
          },
          "kernel_regularizer": {
            "config": {
              "l2": 0.00019999999494757503,
              "l1": 0.0
            },
            "class_name": "L1L2"
          },
          "data_format": "channels_first",
          "kernel_size": [
            1,
            1
          ]
        },
        "inbound_nodes": [
          [
            [
              "input_6",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_16",
        "class_name": "Conv2D"
      },
      {
        "config": {
          "axis": 1,
          "trainable": true,
          "beta_constraint": null,
          "epsilon": 0.001,
          "beta_regularizer": null,
          "gamma_initializer": {
            "config": {},
            "class_name": "Ones"
          },
          "beta_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "gamma_regularizer": null,
          "momentum": 0.99,
          "name": "batch_normalization_16",
          "moving_mean_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "gamma_constraint": null,
          "center": true,
          "moving_variance_initializer": {
            "config": {},
            "class_name": "Ones"
          },
          "scale": true
        },
        "inbound_nodes": [
          [
            [
              "conv2d_16",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_16",
        "class_name": "BatchNormalization"
      },
      {
        "config": {
          "activation": "relu",
          "trainable": true,
          "name": "activation_16"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_16",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_16",
        "class_name": "Activation"
      },
      {
        "config": {
          "dilation_rate": [
            1,
            1
          ],
          "filters": 1,
          "trainable": true,
          "activation": "linear",
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "use_bias": true,
          "activity_regularizer": null,
          "strides": [
            1,
            1
          ],
          "bias_regularizer": null,
          "kernel_constraint": null,
          "name": "conv2d_18",
          "bias_constraint": null,
          "padding": "valid",
          "kernel_initializer": {
            "config": {
              "distribution": "uniform",
              "mode": "fan_avg",
              "seed": null,
              "scale": 1.0
            },
            "class_name": "VarianceScaling"
          },
          "kernel_regularizer": {
            "config": {
              "l2": 0.00019999999494757503,
              "l1": 0.0
            },
            "class_name": "L1L2"
          },
          "data_format": "channels_first",
          "kernel_size": [
            1,
            1
          ]
        },
        "inbound_nodes": [
          [
            [
              "activation_16",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_18",
        "class_name": "Conv2D"
      },
      {
        "config": {
          "dilation_rate": [
            1,
            1
          ],
          "filters": 2,
          "trainable": true,
          "activation": "linear",
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "use_bias": true,
          "activity_regularizer": null,
          "strides": [
            1,
            1
          ],
          "bias_regularizer": null,
          "kernel_constraint": null,
          "name": "conv2d_17",
          "bias_constraint": null,
          "padding": "valid",
          "kernel_initializer": {
            "config": {
              "distribution": "uniform",
              "mode": "fan_avg",
              "seed": null,
              "scale": 1.0
            },
            "class_name": "VarianceScaling"
          },
          "kernel_regularizer": {
            "config": {
              "l2": 0.00019999999494757503,
              "l1": 0.0
            },
            "class_name": "L1L2"
          },
          "data_format": "channels_first",
          "kernel_size": [
            1,
            1
          ]
        },
        "inbound_nodes": [
          [
            [
              "activation_16",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "conv2d_17",
        "class_name": "Conv2D"
      },
      {
        "config": {
          "axis": 1,
          "trainable": true,
          "beta_constraint": null,
          "epsilon": 0.001,
          "beta_regularizer": null,
          "gamma_initializer": {
            "config": {},
            "class_name": "Ones"
          },
          "beta_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "gamma_regularizer": null,
          "momentum": 0.99,
          "name": "batch_normalization_18",
          "moving_mean_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "gamma_constraint": null,
          "center": true,
          "moving_variance_initializer": {
            "config": {},
            "class_name": "Ones"
          },
          "scale": true
        },
        "inbound_nodes": [
          [
            [
              "conv2d_18",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_18",
        "class_name": "BatchNormalization"
      },
      {
        "config": {
          "axis": 1,
          "trainable": true,
          "beta_constraint": null,
          "epsilon": 0.001,
          "beta_regularizer": null,
          "gamma_initializer": {
            "config": {},
            "class_name": "Ones"
          },
          "beta_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "gamma_regularizer": null,
          "momentum": 0.99,
          "name": "batch_normalization_17",
          "moving_mean_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "gamma_constraint": null,
          "center": true,
          "moving_variance_initializer": {
            "config": {},
            "class_name": "Ones"
          },
          "scale": true
        },
        "inbound_nodes": [
          [
            [
              "conv2d_17",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "batch_normalization_17",
        "class_name": "BatchNormalization"
      },
      {
        "config": {
          "activation": "relu",
          "trainable": true,
          "name": "activation_18"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_18",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_18",
        "class_name": "Activation"
      },
      {
        "config": {
          "activation": "relu",
          "trainable": true,
          "name": "activation_17"
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_17",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "activation_17",
        "class_name": "Activation"
      },
      {
        "config": {
          "trainable": true,
          "name": "flatten_12"
        },
        "inbound_nodes": [
          [
            [
              "activation_18",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "flatten_12",
        "class_name": "Flatten"
      },
      {
        "config": {
          "trainable": true,
          "name": "flatten_11"
        },
        "inbound_nodes": [
          [
            [
              "activation_17",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "flatten_11",
        "class_name": "Flatten"
      },
      {
        "config": {
          "units": 1,
          "trainable": true,
          "activation": "relu",
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "use_bias": true,
          "activity_regularizer": null,
          "bias_regularizer": null,
          "name": "dense_6",
          "bias_constraint": null,
          "kernel_constraint": null,
          "kernel_initializer": {
            "config": {
              "distribution": "uniform",
              "mode": "fan_avg",
              "seed": null,
              "scale": 1.0
            },
            "class_name": "VarianceScaling"
          },
          "kernel_regularizer": {
            "config": {
              "l2": 0.00019999999494757503,
              "l1": 0.0
            },
            "class_name": "L1L2"
          }
        },
        "inbound_nodes": [
          [
            [
              "flatten_12",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "dense_6",
        "class_name": "Dense"
      },
      {
        "config": {
          "units": 9,
          "trainable": true,
          "activation": "softmax",
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "use_bias": true,
          "activity_regularizer": null,
          "bias_regularizer": null,
          "name": "policy_output",
          "bias_constraint": null,
          "kernel_constraint": null,
          "kernel_initializer": {
            "config": {
              "distribution": "uniform",
              "mode": "fan_avg",
              "seed": null,
              "scale": 1.0
            },
            "class_name": "VarianceScaling"
          },
          "kernel_regularizer": {
            "config": {
              "l2": 0.00019999999494757503,
              "l1": 0.0
            },
            "class_name": "L1L2"
          }
        },
        "inbound_nodes": [
          [
            [
              "flatten_11",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "policy_output",
        "class_name": "Dense"
      },
      {
        "config": {
          "units": 1,
          "trainable": true,
          "activation": "tanh",
          "bias_initializer": {
            "config": {},
            "class_name": "Zeros"
          },
          "use_bias": true,
          "activity_regularizer": null,
          "bias_regularizer": null,
          "name": "value_output",
          "bias_constraint": null,
          "kernel_constraint": null,
          "kernel_initializer": {
            "config": {
              "distribution": "uniform",
              "mode": "fan_avg",
              "seed": null,
              "scale": 1.0
            },
            "class_name": "VarianceScaling"
          },
          "kernel_regularizer": {
            "config": {
              "l2": 0.00019999999494757503,
              "l1": 0.0
            },
            "class_name": "L1L2"
          }
        },
        "inbound_nodes": [
          [
            [
              "dense_6",
              0,
              0,
              {}
            ]
          ]
        ],
        "name": "value_output",
        "class_name": "Dense"
      }
    ],
    "name": "20180214_KerasModel_TTT_V",
    "output_layers": [
      [
        "policy_output",
        0,
        0
      ],
      [
        "value_output",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.1.3",
  "class_name": "Model",
  "backend": "tensorflow"
}